/*БД салон красоты.
С помощью этой базы можно качественно анализировать данные, без которых сложно растить и развивать бизнес,такие как рост/падение, посещаемость, 
выручка и чистая прибыль и т.д. Также в ней удобно хранить данные о клиентах которые необходимы для построения качественной клиентоориентированности и лояльности.*/



DROP DATABASE IF EXISTS beauty_saloon;
CREATE DATABASE beauty_saloon;
USE beauty_saloon;

DROP TABLE IF EXISTS employees;
CREATE TABLE employees(
	id_employee SERIAL PRIMARY KEY, 
    full_name VARCHAR(70),
    gender CHAR(1),
    birthday DATE,
    phone BIGINT,
    date_of_employment DATETIME DEFAULT NOW(),
    job_position VARCHAR(30),
	experience FLOAT,
    INDEX full_name_idx(full_name),
    INDEX job_position_idx(job_position)
);

INSERT INTO employees 
VALUES (1,' Семочко Шушана','М','1977-11-30',9455771713,'1972-08-08 00:00:00',' косметолог',1),(2,' Орехов Филипп','Ж','1989-01-19',9400799047,'1989-11-20 00:00:00',' косметолог',6),(3,' Козлова Фаина','Ж','1995-01-27',9436674987,'2021-09-29 00:00:00',' парикмахер',0),(4,' Мухин Максим','Ж','1994-01-28',9504165675,'1989-04-16 00:00:00',' директор',6),(5,' Бирюкова Марина','Ж','1974-07-10',9588229942,'2008-07-13 00:00:00','  мастер ногтевого сервиса',3),(6,' Карпова Любовь','Ж','1990-05-25',9159605353,'1987-12-19 00:00:00',' мастер ногтевого сервиса',1),(7,' Негода Алёна','Ж','1995-03-26',9919092949,'1989-10-30 00:00:00',' парикмахер',7),(8,' Бородай Ульяна','М','1973-02-27',9464256428,'1988-08-24 00:00:00',' косметолог',0),(9,'Плаксий Глеб','М','1975-10-15',9399211242,'1986-03-22 00:00:00',' косметолог',9),(10,' Копылов Чеслав','Ж','1972-12-19',9815638697,'2002-09-22 00:00:00',' парикмахер',1),(11,' Красильникова Нина','Ж','1981-06-11',9985922425,'1986-02-19 00:00:00',' менеджер',6),(12,' Дьячкова Василиса','М','1981-01-30',9883919092,'1995-04-15 00:00:00',' парикмахер',9),(13,' Колобова Цвета','Ж','1988-02-07',9999132917,'2013-07-09 00:00:00',' менеджер',8),(14,' Медведева Юнона','М','1973-08-16',9440247780,'2017-09-22 00:00:00',' мастер ногтевого сервиса',9),(15,' Ершова Тамара','Ж','1978-02-20',9744189349,'1974-11-15 00:00:00',' мастер ногтевого сервиса',10);


DROP TABLE IF EXISTS clients;
CREATE TABLE clients(
	id_client SERIAL PRIMARY KEY, 
    full_name VARCHAR(70), 
    gender CHAR(1),
    birthday DATE,
    phone BIGINT,
    total_spend_sum FLOAT, -- сколько потрачено всего(денег)
    card_registration_date DATE, -- дата заведения карты
    INDEX client_name_idx(full_name), 
    INDEX client_phone_idx(phone)
);

INSERT INTO clients 
VALUES (1,' Константинова Наталья','Ж','1983-01-29',9310460475,225746,'2011-01-22'),(2,' Маслов Карл','Ж','2002-03-21',9948341888,322648,'1980-01-30'),(3,' Корнейчук Савва','М','1996-09-04',9177431219,119352,'1996-04-16'),(4,' Данилов Лука','М','1992-10-26',9842736814,84990,'1999-07-09'),(5,' Миронова Тамара','Ж','1980-06-26',9102649893,160560,'1981-01-26'),(6,' Мясникова Людмила','М','1980-03-21',9119209781,252630,'1974-04-01'),(7,' Таранец Раиса','М','2005-09-13',9131933496,476659,'1995-11-24'),(8,' Легойда Елизавета','М','2000-12-20',9265471292,435549,'2008-04-09'),(9,' Сирко Чилита','Ж','1999-12-08',9454609333,376313,'2003-01-31'),(10,' Матвеева Кристина','М','1991-11-04',9319252679,126343,'1990-08-15'),(11,' Блохина Дина','М','1982-08-30',9051063013,12504,'1988-04-04'),(12,'Хитрук Жозефина','М','2001-05-01',9918664775,337031,'2007-09-18'),(13,' Кулагина Октябрина','Ж','1979-08-17',9552924302,292670,'2016-11-01'),(14,' Яковлева Ульяна','Ж','2001-06-23',9744175296,85497,'2004-01-20'),(15,' Острожский Гордей','М','1996-05-12',9570564971,311794,'1974-08-13'),(16,' Овчинникова Богдана','Ж','1982-11-27',9633023932,159702,'2012-07-04'),(17,' Пестов Богдан','Ж','1996-11-01',9419526894,159979,'2018-11-03'),(18,' Беляков Эдуард','М','1973-03-18',9436847133,119704,'1977-10-09'),(19,' Коровяк Юнона','Ж','2000-08-10',9564880973,70584,'2006-12-12'),(20,' Дзюба Злата','М','1986-07-08',9931156370,35814,'2022-05-07'),(21,' Худобяк Елисей','Ж','1979-12-16',9234712119,165989,'2022-06-05'),(22,' Беляев Цезарь','Ж','1971-04-27',9400043000,334696,'1981-06-13'),(23,' Майборода Анжелика','Ж','2003-11-16',9859662006,434189,'2001-11-09'),(24,' Сасько Юна','М','1982-08-30',9539476116,136506,'1976-03-26'),(25,' Колобова Юна','М','2006-05-11',9149045087,329797,'1995-12-03'),(26,' Сазонов Богдан','М','1996-08-24',9328058901,150937,'1993-12-09'),(27,' Моисеенко Евдоким','М','2007-12-01',9804142783,69236,'2000-10-24'),(28,' Овчаренко Фаина','Ж','2004-03-25',9410657118,94004,'2011-12-14'),(29,' Андрусейко Зоя','Ж','1990-01-08',9626352164,433035,'1997-07-06'),(30,' Каськив Алла','Ж','1970-08-24',9877338898,243639,'2015-12-25'),(31,' Коломоец Флорентина','М','1997-11-19',9347242721,121066,'1997-08-30'),(32,' Евдокимова Пелагея','Ж','1991-07-22',9310722045,315487,'1984-04-16'),(33,' Капустина Жасмин','М','1985-10-16',9576100497,20635,'2019-11-28'),(34,' Харитонов Юлий','М','2000-03-04',9213423683,102965,'2011-08-15'),(35,' Афанасьева Яся','М','1985-03-26',9556652758,83166,'1977-01-08'),(36,' Пилипейко Диана','Ж','1983-12-06',9671507381,342638,'2004-08-10'),(37,' Бурова Галина','М','1997-08-02',9888685462,40669,'1977-07-25'),(38,' Ширяева Зинаида','М','1977-05-22',9308917094,246379,'2013-05-26'),(39,' Тихонов Чеслав','Ж','2005-02-28',9176320308,362210,'2018-04-09'),(40,' Степанова Юлия','Ж','1999-10-03',9441752647,266873,'1992-02-15'),(41,' Князев Устин','Ж','1996-03-09',9254249153,179811,'1977-07-08'),(42,' Лобанов Ростислав','М','2007-04-09',9725281857,390708,'2000-08-03'),(43,' Котова София','Ж','2006-05-25',9613190197,153266,'1987-03-31'),(44,' Дьячкова Инна','М','1973-08-17',9374885920,277394,'2011-01-02'),(45,' Давыдов Матвей','М','1984-08-15',9060208218,18102,'1999-11-17'),(46,' Негода Артур','Ж','1996-10-01',9248941928,409693,'1995-11-28'),(47,' Игнатов Афанасий','Ж','1975-12-23',9491863412,12179,'2002-02-19'),(48,' Трясило Янина','Ж','1980-09-20',9827627495,258082,'1976-10-07'),(49,' Забужко Цара','Ж','1992-04-13',9206034386,287117,'1996-11-27'),(50,' Ярова Чечилия','М','1975-10-02',9784056680,137082,'1978-03-14'),(51,' Гусева Цара','М','1990-05-09',9047577408,395201,'2014-01-29'),(52,' Меркушев Харитон','Ж','1995-07-07',9887959248,386044,'1976-09-24'),(53,' Боброва Устинья','М','1993-08-13',9472953747,412882,'2022-02-04'),(54,' Власова Глория','Ж','2005-02-17',9356540238,61723,'1988-04-13'),(55,' Ефимова Йоланта','Ж','1976-09-13',9492593600,43862,'1987-06-14'),(56,' Журавлёва Софья','М','1992-02-02',9087996803,270401,'1988-04-08'),(57,' Кириленко Эдда','М','1977-04-06',9676579142,122616,'2002-12-09'),(58,' Шумило Шушана','Ж','1974-01-06',9952032624,162306,'2015-07-05'),(59,' Некрасова Валерия','Ж','1988-04-07',9735621716,69861,'2020-03-21'),(60,' Федункив Янита','М','1989-01-30',9986631616,416123,'2017-05-25'),(61,' Павлова Цилла','Ж','1989-09-08',9506354903,153863,'1983-10-14'),(62,' Лазарева Ульяна','Ж','1980-08-03',9961990285,161698,'1977-02-15'),(63,' Волкова Клавдия','Ж','1993-12-13',9154410656,478313,'1985-05-15'),(64,' Хованска Анфиса','М','2004-10-07',9100056572,162631,'1972-03-23'),(65,' Гуляев Валерий','М','1983-04-26',9223717747,193360,'1991-09-27'),(66,' Шевченко Юнона','М','1987-10-09',9404801900,151867,'1983-07-19'),(67,' Уварова Чилита','М','1999-09-05',9727446995,327348,'1986-04-20'),(68,' Петровска Софья','М','1992-05-06',9455056402,147522,'2007-12-04'),(69,' Носова Хильда','Ж','1991-07-28',9057365078,308814,'2022-05-07'),(70,' Рымар Оксана','Ж','1978-11-10',9596946013,450615,'1970-06-01'),(71,' Шумило Григорий','М','1989-01-10',9193966001,456067,'1984-11-14'),(72,' Борисова Клементина','М','2002-10-22',9509568413,171896,'1986-06-03'),(73,' Кузьмина София','М','1996-05-30',9752591076,5301,'1974-07-20'),(74,' Агафонов Евстахий','Ж','2006-12-10',9992740456,74032,'2018-04-15'),(75,' Алчевска Шанетта','Ж','1971-04-22',9870932808,15660,'1975-08-13'),(76,' Лаврентьева Инесса','М','1988-06-24',9887497349,250252,'1988-08-04'),(77,' Щукина Цвета','М','2002-04-22',9879135700,105995,'1975-04-10'),(78,' Зайцева Шарлота','М','1981-01-23',9953057724,381535,'1996-09-26'),(79,' Каськив Эллада','М','1979-05-01',9211297613,411453,'2015-04-13'),(80,' Жуков Богдан','М','1999-01-16',9845640572,188759,'2014-06-29'),(81,' Скляренко Эмилия','Ж','1973-04-15',9842925820,166241,'1980-05-23'),(82,' Коцюбинска Татьяна','Ж','1979-02-02',9040955230,164803,'1982-06-25'),(83,' Назаров Гордей','Ж','1970-08-12',9079666138,271298,'2009-02-21'),(84,' Зыков Яромир','Ж','1989-02-16',9302209948,346790,'2018-02-11'),(85,' Мирный Харитон','М','1999-11-06',9140903129,249830,'2000-01-08'),(86,' Воронов Яков','Ж','1979-09-25',9972927033,308315,'1994-05-03'),(87,' Сорокина Цветелина','М','1984-12-15',9140710164,188561,'1996-06-27'),(88,' Горбунова Вероника','М','1978-02-17',9841029108,58996,'2002-03-17'),(89,' Беляева Гаянэ','Ж','2004-05-13',9390101775,210603,'1984-12-07'),(90,' Гелетей Рада','М','1991-07-16',9214052250,58102,'1979-03-07'),(91,' Суханова Зоя','Ж','2004-01-08',9596364318,161346,'2011-11-19'),(92,' Скоропадска Анфиса','М','1992-03-07',9019593324,289798,'2010-01-18'),(93,' Рыбакова Устинья','М','1999-03-31',9329345807,214960,'2019-05-18'),(94,' Кличко Эдуард','М','2002-02-19',9936832283,448637,'1977-06-24'),(95,' Волкова Харита','Ж','1971-04-14',9218255572,131211,'1970-11-30'),(96,' Орлов Валентин','Ж','1982-12-23',9650136246,188033,'2013-01-04'),(97,' Тимошенко Дарья','Ж','1990-02-06',9061495507,318754,'1997-04-24'),(98,' Дроздов Любомир','Ж','1977-05-04',9189973541,429808,'1999-10-05'),(99,' Червоний Чеслав','М','1987-07-08',9802484588,225394,'2003-07-15'),(100,' Ильина Устинья','Ж','2002-02-17',9417223125,409223,'1988-06-26');


DROP TABLE IF EXISTS offices; -- кабинеты
CREATE TABLE offices(
	id_office SERIAL PRIMARY KEY, 
    office_name VARCHAR(20), -- название кабинета
    employee1_id BIGINT UNSIGNED NOT NULL, -- связь с мастерами
    employee2_id BIGINT UNSIGNED NOT NULL,
	FOREIGN KEY (employee1_id) REFERENCES employees(id_employee),-- 1 к 1
	FOREIGN KEY (employee2_id) REFERENCES employees(id_employee)
);

INSERT INTO offices 
VALUES (1,' кабинет ногтевого с',5,14),(2,' кабинет ногтевого с',6,15),(3,' кабинет косметолога',2,8),(4,'парикмахерской зал',3,7),(5,' кабинет косметолога',9,1),(6,'парикмахерской зал',10,12),(7,' солярий',11,13);



DROP TABLE IF EXISTS services;
CREATE TABLE services(
	id_service SERIAL PRIMARY KEY, 
    service_name VARCHAR(100), -- услуга
    office_id BIGINT UNSIGNED NOT NULL, -- зал
    cost FLOAT,  -- себестоимость
 	priсe FLOAT, -- цена
    cost_of_the_master FLOAT, -- зп мастера с услуги
    INDEX service_name_idx(service_name),
    FOREIGN KEY (office_id) REFERENCES offices(id_office) -- 1 к 1
);

INSERT INTO services 
VALUES (1,'Микроблейдинг',3,426.76,9000,519.33),(2,'Растяжка',3,2751.47,4500,868.02),(3,'Укладка',4,120.22,1000,483.92),(4,' Мужской педикюр',4,270.22,2200,527.69),(5,' Снятие одного треса',4,24.26,500,851.75),(6,' Кошачий глаз',2,675.91,6000,944.98),(7,' Солярий',7,21.43,150,663.81),(8,' Макияж',5,617.26,3500,628.48),(9,' Пудровое напыление бровей',6,654.92,8000,441.33),(10,' Окраска волос',4,654.68,3500,847),(11,' 2Д наращивание',5,564.95,2300,522.66),(12,' Коктейльный макияж',3,239.13,1500,202.45),(13,' Укладка на плойку',1,19.01,1900,350.84),(14,' Покрытие гель-лаком',3,75.47,1600,375.44),(15,' педикюр аппаратный',6,53.33,1500,219.62),(16,' Капсульное наращивание',6,1123.17,25000,201.92),(17,' СПА педикюр',1,285.47,1900,708.35),(18,' Трессы пришивные (1 прядь пришить)',1,62.79,400,838.41),(19,' Окрашивание бровей хной',2,4.79,500,665.95),(20,' Мега волюм',6,90.32,1100,845.04),(21,' Изменение цвета',5,241.61,2500,699.26),(22,' Окрашивание ресниц краской',6,18.17,1200,886.08),(23,' Детская стрижка',4,52.02,700,960.36),(24,' Снятие',3,14.5,100,390.51),(25,' СПА маникюр',6,295.72,1100,417.7),(26,' Мужская стрижка',6,65.64,750,486.99),(27,' Окрашивание бровей краской',6,84.56,650,266.59),(28,' Оформление бровей',5,9.68,800,785.8),(29,' Окраска корней',1,218.5,1500,288.12),(30,' Стрижка челки',5,25.06,350,457.68),(31,' Коррекция',7,43.41,1200,552.18),(32,' Плетение',3,93.81,1700,924.72),(33,' Снятие нарощенных волос',7,174.23,3500,212.69),(34,' Массаж ',7,174.34,2500,547.74),(35,' Маникюр аппаратный',4,38.06,1100,748.74),(36,' Коррекция бровей',5,34.84,550,641.27),(37,'Стрижка с укладкой',5,87.91,2700,708.18),(38,' 3Д наращивание',3,283.16,3000,429.13),(39,' Прическа вечерняя',6,119.64,2000,888.41),(40,' Окрашивание ресниц хной',1,22.33,670,621.48),(41,' Маникюр классический',1,17.07,800,825.83),(42,' Наращивание ресниц классика',5,98.95,1500,944.37),(43,' Ленточное наращивание волос',3,1192.66,7500,375.03),(44,' Спа',2,211.74,4300,933.95),(45,' Френч',1,92.84,1400,563.33),(46,' Педикюр классический',5,95.11,1700,967.6);


DROP TABLE IF EXISTS appointments; -- записи
CREATE TABLE appointments(
	id_appointment SERIAL PRIMARY KEY, 
    client_id BIGINT UNSIGNED NOT NULL, -- клиент -- с клиентами
    employee_id BIGINT UNSIGNED NOT NULL, -- сотрудники
    service_id BIGINT UNSIGNED NOT NULL,  -- услуги
    service_name VARCHAR(100),
    visit_date DATE, -- дата посещения
    backup_employee BIGINT UNSIGNED NOT NULL, -- запасной мастер
    INDEX appointments_visit_date_idx(visit_date),
	INDEX appointments_client_idx(client_id),
	FOREIGN KEY (employee_id) REFERENCES employees(id_employee), -- М к 1
	FOREIGN KEY (backup_employee) REFERENCES employees(id_employee), -- М к 1
    FOREIGN KEY (client_id) REFERENCES clients(id_client), -- 1 к 1
    FOREIGN KEY (service_id) REFERENCES services(id_service), -- М к М, потому что несколько коло в таб записи ссылаются на кол в таб услуги
    FOREIGN KEY (service_name) REFERENCES services(service_name) -- М к М, потому что несколько коло в таб записи ссылаются на кол в таб услуги
);

INSERT INTO appointments 
VALUES (1,18,10,4,' Мужской педикюр','2022-09-04',15),(2,78,7,8,' Макияж','2022-10-10',1),(3,6,2,35,' Маникюр аппаратный','2020-05-04',10),(4,28,15,1,'Микроблейдинг','2021-11-09',10),(5,49,5,14,' Покрытие гель-лаком','2021-02-07',3),(6,83,14,39,' Прическа вечерняя','2020-03-09',6),(7,82,5,5,' Снятие одного треса','2020-10-02',6),(8,22,6,17,' СПА педикюр','2022-09-04',2),(9,12,7,32,' Плетение','2021-10-10',3),(10,97,13,31,' Коррекция','2021-01-06',5),(11,16,11,4,' Мужской педикюр','2020-08-25',14),(12,16,13,11,' 2Д наращивание','2020-01-07',2),(13,60,2,33,' Снятие нарощенных волос','2021-05-28',6),(14,14,9,41,' Маникюр классический','2021-03-15',5),(15,43,8,46,' Педикюр классический','2022-09-30',10),(16,13,13,35,' Маникюр аппаратный','2020-10-30',15),(17,2,2,12,' Коктейльный макияж','2022-10-11',2),(18,8,8,11,' 2Д наращивание','2022-09-11',13),(19,83,13,8,' Макияж','2021-08-04',2),(20,43,1,5,' Снятие одного треса','2021-06-06',11),(21,29,14,38,' 3Д наращивание','2022-10-04',7),(22,100,2,45,' Френч','2022-10-04',7),(23,38,15,38,' 3Д наращивание','2022-10-10',1),(24,90,12,16,' Капсульное наращивание','2019-04-03',15),(25,21,10,44,' Спа','2021-06-02',7),(26,61,2,30,' Стрижка челки','2019-06-15',6),(27,24,10,10,' Окраска волос','2020-08-15',15),(28,25,12,7,' Солярий','2022-10-12',13),(29,89,7,1,'Микроблейдинг','2020-04-23',8),(30,21,10,46,' Педикюр классический','2021-04-23',7),(31,26,5,30,' Стрижка челки','2022-10-10',7),(32,95,5,25,' СПА маникюр','2019-10-09',3),(33,73,12,18,' Трессы пришивные (1 прядь пришить)','2022-10-09',5),(34,60,2,9,' Пудровое напыление бровей','2021-08-08',12),(35,75,3,3,'Укладка','2020-02-06',11),(36,6,12,45,' Френч','2021-06-30',6),(37,98,4,32,' Плетение','2019-09-04',5),(38,16,10,37,'Стрижка с укладкой','2021-03-22',4),(39,28,1,40,' Окрашивание ресниц хной','2020-02-03',4),(40,77,3,6,' Кошачий глаз','2020-05-19',15),(41,58,12,36,' Коррекция бровей','2021-02-19',1),(42,91,13,36,' Коррекция бровей','2021-09-07',15),(43,23,14,29,' Окраска корней','2019-06-08',1),(44,59,6,16,' Капсульное наращивание','2019-09-02',9),(45,2,12,35,' Маникюр аппаратный','2019-12-24',5),(46,92,8,39,' Прическа вечерняя','2019-11-09',8);


DROP TABLE IF EXISTS stock; -- запасы
CREATE TABLE stock(
	product_id SERIAL PRIMARY KEY, 
    amount_in_stock INT, -- кол-во на складе -- с зак рас
    min_amount INT, -- мин необ кол-во
    unit_cost FLOAT,  -- закуп. цена за ед. с НДС
 	used_in_service BIGINT UNSIGNED NOT NULL, -- испол в услуге -- связь с наименованием услуги
 	INDEX product_id_amount_idx(product_id,amount_in_stock), -- остаток/наличие 
 	FOREIGN KEY (used_in_service) REFERENCES services(id_service) -- 1 к 1
);

INSERT INTO stock 
VALUES (1,118,54,915.8,43),(2,17,72,2854.16,18),(3,20,82,2798.87,37),(4,114,64,1045.07,38),(5,17,58,1448.09,28),(6,37,59,459.73,12),(7,148,98,2741.94,8),(8,1,48,642.51,45),(9,33,57,1643.93,24),(10,8,89,2891.61,14),(11,64,48,1769.15,5),(12,145,93,2360.6,37),(13,94,57,796.41,29),(14,56,77,378.76,34),(15,147,88,1990.27,7),(16,73,89,541.97,26),(17,136,71,576.89,4),(18,115,73,1635.03,22),(19,58,98,712.19,4),(20,49,42,1640.79,37),(21,148,91,2205.03,1),(22,91,50,2555.56,22),(23,34,91,2955.18,5),(24,74,48,2834.14,8),(25,6,86,1412.89,4),(26,127,57,1640.15,32),(27,12,51,2949.4,44),(28,76,98,2603.34,25),(29,67,58,2778.74,20),(30,62,43,1083.86,40),(31,110,63,523.7,23),(32,45,50,915.23,16),(33,53,46,1581.9,11),(34,34,69,488.46,14),(35,118,42,2208.13,8),(36,44,88,2798.56,39),(37,63,83,1884.1,25),(38,111,45,1769.39,15),(39,37,93,2465.67,37),(40,95,94,1776.35,2),(41,71,72,456.57,29),(42,46,95,867.6,42),(43,143,92,621.45,38),(44,33,55,1100.89,12),(45,31,45,877.16,29),(46,135,88,913.62,45),(47,147,48,1355.86,37),(48,144,87,530.83,33),(49,1,81,1041.01,21),(50,148,70,832.32,41),(51,103,52,2625.98,23),(52,0,72,399.37,22),(53,141,72,2077.86,16),(54,60,45,2504.8,28),(55,7,79,875.55,29),(56,86,70,2120.73,20),(57,10,82,2106.72,13),(58,81,78,1472.9,27),(59,51,92,1379.82,44),(60,127,86,2588.87,32),(61,34,44,1985.2,20),(62,109,43,1085.99,20),(63,97,62,2374.02,2),(64,110,100,2509.57,31),(65,55,64,2373.21,34),(66,80,73,1445.8,10),(67,62,100,2935.98,23),(68,72,91,1047.05,12),(69,37,81,2550.54,25),(70,2,87,2268.84,14),(71,115,74,1114.95,13),(72,119,47,2224.31,7),(73,26,89,857.91,10),(74,111,77,871.91,5),(75,137,64,2101.66,18);


DROP TABLE IF EXISTS consumables_orders; -- заказ расходников
CREATE TABLE consumables_orders(
	id_consumables_orders SERIAL PRIMARY KEY, 
    product_id BIGINT UNSIGNED NOT NULL, -- название
    pr_amount INT, -- кол-во прод.
    order_price FLOAT,  -- цена заказа
 	supplier VARCHAR(40), -- поставщик
 	INDEX consumables_orders_product_id_idx(product_id),
    INDEX consumables_orders_supplier_idx(supplier),
    FOREIGN KEY (product_id) REFERENCES stock(product_id) -- 1 к 1
);

INSERT INTO consumables_orders 
VALUES (1,1,67,44678.8,'Dietrich-Langworth'),(2,2,55,115928,'Welch Ltd'),(3,3,92,60627.8,'Jacobs Ltd'),(4,4,74,75683,'Bailey, Dietrich and Hackett'),(5,5,46,95365.2,'O\'Hara, McDermott and Ortiz'),(6,6,50,143509,'Zemlak Inc'),(7,7,85,107951,'Gerhold-Anderson'),(8,8,127,25920.9,'Beatty PLC'),(9,9,60,17284.6,'Carroll and Sons'),(10,10,118,37240.3,'Halvorson-Volkman'),(11,11,112,28532.6,'Larson, Corkery and Kuhn'),(12,12,80,30798.5,'Pagac Inc'),(13,13,57,96871.4,'Kling, Mraz and Mayert'),(14,14,136,45530,'Hartmann-Keeling'),(15,15,137,113367,'Corkery and Sons'),(16,16,112,135794,'Corkery-Brown'),(17,17,61,118887,'Lowe-Shanahan'),(18,18,57,40216,'Berge LLC'),(19,19,90,85433.3,'Ferry, Bayer and Kautzer'),(20,20,122,84320.7,'Williamson, Haag and Treutel'),(21,21,91,132252,'Zboncak LLC'),(22,22,43,110021,'Davis-Reichert'),(23,23,147,77241.3,'Carter Ltd'),(24,24,66,12031.3,'Watsica, Mitchell and Kshlerin'),(25,25,65,122197,'Gislason Group'),(26,26,125,75216.2,'Cummings Inc'),(27,27,134,69267.3,'Ondricka, Bechtelar and Koepp'),(28,28,121,100862,'Anderson, Cormier and Wintheiser'),(29,29,66,44591.7,'Wisozk LLC'),(30,30,40,41743.5,'Beer-Predovic'),(31,31,150,126156,'Wiza PLC'),(32,32,142,107273,'Walker-Krajcik'),(33,33,44,81656.7,'Wilderman-Gutmann'),(34,34,42,51574.4,'Ankunding, Walter and Zieme'),(35,35,97,106581,'Tromp Group'),(36,36,46,33307.5,'Strosin LLC'),(37,37,71,122768,'Bruen Inc'),(38,38,106,89950.6,'Tromp-Jacobson'),(39,39,86,34141.1,'Rutherford, Lueilwitz and Lesch'),(40,40,124,123953,'Stracke-Crist'),(41,41,98,77491.5,'Ryan-Rohan'),(42,42,73,139155,'Cummings Inc'),(43,43,143,50478.9,'Ziemann PLC'),(44,44,79,102537,'Legros, Waters and Durgan'),(45,45,62,22376.9,'Kiehn, McCullough and Muller'),(46,46,147,48212.9,'Hansen, Schowalter and Krajcik'),(47,47,104,49386.9,'Smitham and Sons'),(48,48,109,140497,'Funk, Abshire and Hilll'),(49,49,102,88458.3,'Dare-Altenwerth'),(50,50,72,55291.9,'Moore PLC'),(51,51,136,104373,'Simonis PLC'),(52,52,103,85446.9,'Heller Ltd'),(53,53,145,133694,'Dibbert, Williamson and Kassulke'),(54,54,138,66935.9,'Erdman-Bartell'),(55,55,59,15334.9,'Johnston and Sons'),(56,56,66,52205.6,'Pouros, Effertz and O\'Kon'),(57,57,85,92474,'Baumbach PLC'),(58,58,45,144020,'Beatty and Sons'),(59,59,95,119612,'DuBuque Inc'),(60,60,118,44258.1,'McLaughlin, Hagenes and Kohler'),(61,61,125,134895,'Frami PLC'),(62,62,86,87078.6,'Schamberger LLC'),(63,63,49,35449.1,'Ledner PLC'),(64,64,141,136786,'Barrows-Bradtke'),(65,65,140,93065.1,'Kerluke, Kertzmann and Kozey'),(66,66,122,19974,'Grady Ltd'),(67,67,90,83764.7,'Osinski, Rippin and Dietrich'),(68,68,111,59977.9,'Renner and Sons'),(69,69,75,103759,'Bernier, Cole and Rolfson'),(70,70,61,105789,'Carroll-Pfeffer'),(71,71,116,141976,'Lynch Inc'),(72,72,144,58676.6,'DuBuque, Prohaska and Ankunding'),(73,73,148,132846,'Mitchell-Davis'),(74,74,138,47714.5,'Green-Mante'),(75,75,127,98467,'Runolfsson, Schneider and Stamm');


DROP TABLE IF EXISTS medical_record_status; -- мед книжки
CREATE TABLE medical_record_status(
	id_medical_record_status SERIAL PRIMARY KEY, 
    employee_id BIGINT UNSIGNED NOT NULL , -- имя мастера
    date_of_receiving DATE, -- дата получения
	expiration_date DATE, -- дата окончания
	status CHAR(1), -- статус
	INDEX medical_record_status_idx(status),
	FOREIGN KEY (employee_id) REFERENCES employees(id_employee) -- 1 к 1
);	

INSERT INTO medical_record_status 
VALUES (1,5,'2021-12-20','2022-10-18','1'),(2,14,'1979-06-13','2022-10-16','1'),(3,1,'2006-10-27','2024-08-07','1'),(4,6,'2021-12-05','2022-11-23','1'),(5,11,'2021-08-03','2022-10-14','1'),(6,15,'2007-01-18','2021-10-14','0'),(7,4,'2002-11-13','2025-01-13','1'),(8,8,'2009-02-11','2023-12-20','1'),(9,9,'2009-02-13','2024-04-14','1'),(10,7,'1994-11-08','2025-10-16','1'),(11,12,'1990-12-08','2023-10-13','1'),(12,13,'1996-02-01','2026-05-23','1'),(13,10,'1983-06-21','2026-11-28','1'),(14,2,'1977-04-05','2021-11-21','0'),(15,3,'2019-07-23','2022-11-26','1');

	
DROP TABLE IF EXISTS discounts; -- скидка клиента
CREATE TABLE discounts(
	id_discounts  SERIAL PRIMARY KEY, 
    id_clients BIGINT UNSIGNED NOT NULL, -- id клиента
    discount_percentage INT,-- процент скидки
    FOREIGN KEY (id_clients) REFERENCES clients(id_client) -- 1 к 1
);

INSERT INTO discounts 
VALUES (24,1,19),(37,1,20),(73,1,11),(91,2,4),(95,4,11),(68,5,7),(31,6,18),(55,6,2),(20,7,3),(98,7,19),(64,8,18),(86,9,6),(3,11,15),(51,11,0),(78,11,11),(85,13,10),(48,16,13),(5,18,0),(15,19,10),(40,21,15),(27,22,5),(76,23,0),(70,25,12),(62,28,11),(4,29,16),(47,29,12),(1,30,16),(63,30,2),(84,30,12),(23,31,14),(75,32,20),(16,33,5),(34,34,15),(94,34,6),(56,35,7),(44,37,5),(72,37,0),(29,38,15),(87,41,17),(14,42,0),(33,42,2),(41,42,1),(42,42,7),(60,43,1),(88,45,9),(99,45,3),(13,47,0),(46,47,2),(21,49,16),(52,50,12),(11,51,14),(45,51,13),(49,51,20),(17,54,3),(22,54,14),(59,55,2),(8,56,6),(80,57,2),(18,58,15),(92,58,17),(38,59,2),(54,59,14),(61,61,20),(30,63,9),(43,63,4),(65,64,6),(71,64,12),(57,65,12),(74,66,0),(82,66,4),(90,66,1),(12,69,12),(36,69,9),(67,70,1),(81,70,1),(83,70,11),(10,75,19),(32,75,2),(100,75,1),(25,76,20),(2,77,4),(7,77,5),(66,78,18),(89,78,18),(93,80,4),(26,81,11),(6,82,16),(28,83,6),(50,84,9),(53,85,10),(9,86,0),(19,86,13),(39,87,11),(79,87,3),(96,87,18),(77,89,4),(97,90,12),(58,92,7),(69,95,12),(35,100,16);

-- use beauty_saloon	

DROP VIEW IF EXISTS employee_information; -- представление для удобного вывода всей, или части, нужной информации по мастерам салона. 

CREATE VIEW employee_information AS
    SELECT employees.id_employee,
    employees.full_name,
    employees.job_position,
    offices.office_name,
    medical_record_status.expiration_date,
    medical_record_status.status 
FROM 
employees, offices, medical_record_status 
WHERE (employees.id_employee = offices.employee1_id OR employees.id_employee = offices.employee2_id)
AND employees.id_employee = medical_record_status.employee_id;

-- SELECT * FROM employee_information;

DROP VIEW IF EXISTS product_information; -- информация о продуктах

CREATE VIEW product_information AS
	SELECT stock.product_id,
	stock.amount_in_stock,
	stock.min_amount,
	stock.unit_cost,
	consumables_orders.supplier
FROM
stock,consumables_orders
WHERE stock.product_id = consumables_orders.product_id;

SELECT * FROM product_information;

DROP PROCEDURE IF EXISTS sp_appointments_today; -- для просмотра записей на сегодня
DELIMITER //  
CREATE PROCEDURE sp_appointments_today ()  
BEGIN  
    SELECT 
    client_id,
    employee_id,
    service_name,
    visit_date
	FROM appointments WHERE CAST(visit_date AS date) = CURDATE();     
END //  
DELIMITER ;

-- CALL sp_appointments_today(); 

DROP PROCEDURE IF EXISTS sp_stock_needed; -- для просмотра, что надо закупить
DELIMITER //  
CREATE PROCEDURE sp_stock_needed ()  
BEGIN  
    SELECT 
    product_id, 
    amount_in_stock,
    min_amount,
    min_amount - amount_in_stock AS amount_to_buy
	FROM stock WHERE amount_in_stock < min_amount;
	-- SELECT min_amount - amount_in_stock AS amount_to_buy
	-- FROM stock;
END //  
DELIMITER ;

-- CALL sp_stock_needed (); 

DELIMITER $$
$$
CREATE DEFINER=`root`@`localhost` TRIGGER `restock` AFTER UPDATE ON `stock` FOR EACH ROW BEGIN 
		IF NEW.amount_in_stock < NEW.min_amount THEN 
			SIGNAL SQLSTATE  '45000' SET MESSAGE_TEXT = 'Проверь расходники! Нужен дозаказ';
	END IF;
END 
$$
DELIMITER ;  -- Тригер 1

/*UPDATE stock -- Проверка работы тригера 1
SET
amount_in_stock = 1
WHERE amount_in_stock > 10;*/

DELIMITER $$
$$
CREATE DEFINER=`root`@`localhost` TRIGGER `expired_medical_book` AFTER INSERT ON `medical_record_status` FOR EACH ROW BEGIN 
		IF NEW.expiration_date <= curdate() THEN 
			SIGNAL SQLSTATE  '45000' SET MESSAGE_TEXT = 'Мед. книжка недействительна! Сотрудник не может приступить к работе!';
	END IF;
END
$$
DELIMITER ;  -- Тригер 2. 

/*INSERT INTO medical_record_status
VALUES (15,3,'2019-07-23','2021-11-26','1');*/


-- 1) Вывести 3- х клиентов (имя, пол, накопления)  с самыми большими накоплениями.

SELECT id_client, full_name, gender, total_spend_sum
FROM clients 
ORDER BY total_spend_sum DESC
LIMIT 3;

-- 2) Вывести всех сотрудников у которых заканчивается или закончилась мед книжка.

SELECT employees.id_employee, 
employees.full_name, 
medical_record_status.expiration_date,
datediff(medical_record_status.expiration_date,curdate()) AS days_left
FROM employees 
JOIN medical_record_status ON employees.id_employee = medical_record_status.employee_id AND datediff(medical_record_status.expiration_date,curdate()) <= 10
ORDER BY days_left;

-- 3) Определить сотрудника с самым высоким доходом за предыдущий месяц.

SELECT appointments.employee_id,
employees.full_name,
sum(round(services.cost_of_the_master,2)) AS salary
FROM appointments, employees, services
WHERE employees.id_employee = appointments.employee_id AND (MONTH(appointments.visit_date) = (MONTH(now())-1)) AND (YEAR(appointments.visit_date) = YEAR(now()))
GROUP BY appointments.employee_id, employees.full_name
ORDER BY salary DESC
LIMIT 1;

-- 4) Определить самую популярную услугу в салоне.

SELECT service_name,
count(service_name) 
FROM appointments
GROUP BY service_name 
ORDER BY count(service_name) DESC
LIMIT 1;

-- 5) Рассчитать чистую прибыль салона за 3 предыдущих года и этот, на сегодняшний момент.

SELECT 
sum(round((services.priсe - services.cost),2)) AS profit,
YEAR(appointments.visit_date) AS s_year
FROM appointments, services WHERE appointments.service_name = services.service_name AND YEAR(appointments.visit_date) >= YEAR(NOW()) - 3
GROUP BY s_year
ORDER BY s_year ASC;

-- 6) Определить насколько выросла/упала посещаемость салона за последнии 2 года, исходя из полученных данных предположить 
-- итоги посещаемости салона в этом году (будет рост или падение) 

SELECT 
COUNT(id_appointment) AS client_v,
YEAR(visit_date) AS v_year
FROM appointments WHERE YEAR(visit_date) >= YEAR(NOW()) - 2
GROUP BY v_year
ORDER BY v_year ASC;

-- предпологается рост.







